Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/after_your_baby_is_born/your_health_after_birth.html.txt.tmx
Source language: en
Languages: ga

source: Your health after birth
ga: Do Shláinte tar éis na Breithe

source: Pregnancy and childbirth put a great strain on your body and it will take time to recover, particularly if you have had a difficult labour or a Caesarean section
ga: Cuireann toircheas agus breith linbh stró mór ar do chorp agus tógfaidh sé riar ama teacht chugat féin arís, go háirithe má bhí luí seoil chrua agat nó gearradh Caesarach

source: You may have been ill after having your baby, or you may suffer from a common range of minor ailments and infections that affect new mothers
ga: B'fhéidir go raibh tú tinn tar éis duit do leanbh a shaolú, nó b'fhéidir go mbeifeá ag fulaingt ó raon coitianta mionbhreoiteachtaí agus mionionfhabhtuithe a chuireann isteach ar mháithre

source: Your hospital or public health nurse will be able to supply you with details of local postnatal exercise classes
ga: Beidh ar chumas an ospidéal nó do altra sláinte poiblí mionsonraí a chur ar fáil duit maidir le ranganna aclaíochta iarbhreithe

source: If you have had a normal delivery, you will then have a check-up after 2 weeks and then after 6 weeks
ga: Má bhí gnáthluí seoil agat, ansin cuirfear scrúdú ort tar éis 2 sheachtain agus arís tar éis 6 seachtain

source: This will be carried out either by your GP or by the hospital if you had your baby in hospital
ga: Déanfaidh do dhochtúir teaghlaigh nó an ospidéal ina raibh an páiste agat é sin

source: Your GP or hospital doctor will discuss any health problems with you and may take a cervical smear
ga: Pléifidh do dhochtúir teaghlaigh/dhochtúir ospidéil aon fhadhbanna sláinte leis agus b'fhéidir go dtógfadh siad smearadh ceirbheacsach

source: For some women, breastfeeding is established easily, but others find it takes longer to get comfortable
ga: Do roinnt ban, tarlaíonn beathú cíchego héasca, ach tógann se níos faide ar dhaoine eile a bheith compordach

source: Some find that the demands of a young baby and a new lifestyle make them feel low and, sometimes depressed
ga: Mothaíonn roinnt go n-íslíonn riachtanais naíonáin óga agus bealach nua saoil a meanmna, agus ó am go chéile, bíonn dúlagar orthu

source: This is quite normal after having a baby and help is available
ga: Is gnáthrud é sin tar éis leanbh a shaolú agus tá cabhair ar fáil
